;*******************************************************************************
; e2prom.asm
; Функции памяти e2prom
; 
; Автор: Д. Лунегов, dlunegov@gmail.com
;
; История: 20.03.2016 - Файл создан
;
;*******************************************************************************
    #include "hardware_profile.inc"
    radix dec
;-------------------------------------------------------------------------------
; ГЛОБАЛЬНЫЕ ФУНКЦИИ
;-------------------------------------------------------------------------------
    global  EEReadData
;-------------------------------------------------------------------------------
; ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ
;-------------------------------------------------------------------------------
    global  ee_addr_data, ee_addrh_data, ee_data, ee_datah
;-------------------------------------------------------------------------------
; ДАННЫЕ    (ПОЛЗОВАТЕЛЬСКИЕ, НАСТРАИВАЕМЫЕ) 
;-------------------------------------------------------------------------------

;-------------------------------------------------------------------------------
; РЕГИСТРЫ  (ПОЛЗОВАТЕЛЬСКИЕ, НАСТРАИВАЕМЫЕ)
;-------------------------------------------------------------------------------

;-------------------------------------------------------------------------------
; РЕГИСТРЫ  ФУНКЦИЙ
;-------------------------------------------------------------------------------
    udata
ee_addr_data	res 1	; младший адрес
ee_addrh_data	res 1	; старший адрес
ee_data		res 1	; младший байт данных
ee_datah	res 1	; страший байт данных
 
;-------------------------------------------------------------------------------
; НАЧАЛО КОДА
;-------------------------------------------------------------------------------
STARTUP	code
;*******************************************************************************
;* ФУНКЦИЯ  : Принимает 8-битное значение по асинхронному каналу
;* РЕСУРСЫ  : Модуль USART	
;* ВХОД	    : Нет
;* ВЫХОД    : Принятый байт - uart_data_in
;* ВЫХОД    : Байт-ошибка uart_error:
;*******************************************************************************	
EEReadData
;	banksel	INTCON		; стоит ли???
;	bcf	INTCON, GIE
	banksel ee_addr_data
	movf	ee_addr_data, w
	banksel	EEADR
	movwf	EEADR		; адрес чтения данных eeprom
	banksel	EECON1
	bcf	EECON1, EEPGD	; 0 - выбрана память eeprom
	bsf	EECON1, RD	; чтение памяти
	banksel	EEDATA		
	movf	EEDATA, w	; EEDAT >> ee_data
	banksel	ee_data
	movwf	ee_data
;	retfie
	return
	
	
;EEReadCheck
;	banksel	PIR2
;	pagesel	EEReadCheck
;	btfss	PIR2, EEIF	; данные записаны?
;	goto	EEReadCheck	; нет, ждемс..
;	bcf	PIR2, EEIF	; да, обнуляем флаг записи
	
	
	
	
	end


