;*******************************************************************************
; ledarray8.asm
;
;
;
; Автор: Д. Лунегов, dlunegov@gmail.com
;
; История: 06.03.2016 - Файл создан
;
;*******************************************************************************
    #include "hardware_profile.inc"
    radix dec
    global led_temp			; глобальная переменная
    global LedTurnOn			; глобальная функция 

;-------------------------------------------------------------------------------
; РЕГИСТРЫ (ПОЛЗОВАТЕЛЬСКИЕ)
;-------------------------------------------------------------------------------
    
PORT_LED8   equ	PORTD   ; назначение порта на массив светодиодов
TRIS_LED8   equ	TRISD	; назначение конфигурационного регистра
	
;-------------------------------------------------------------------------------
; ДАННЫЕ
;-------------------------------------------------------------------------------
	
    udata
led_temp    res	    1	;зарезервирован байт под временный регистр

;-------------------------------------------------------------------------------
; НАЧАЛО КОДА
;-------------------------------------------------------------------------------
   
STARTUP	code

;-------------------------------------------------------------------------------
; Функция настройки и включения массива 8 светодиодов
;-------------------------------------------------------------------------------	
LedTurnOn
	banksel	PORT_LED8
	clrf	PORT_LED8	; конфиг. порта
	banksel	led_temp
	movwf	led_temp	
	comf	led_temp, w
	banksel	TRIS_LED8
	movwf	TRIS_LED8
	
	banksel	led_temp
	movf	led_temp, w	; вкл светодиодов
	banksel	PORT_LED8
	movwf	PORT_LED8
	
	return
	
	end
	

